target/conf/req/doi_sim.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ins="http://soa.comptel.com/2011/02/instantlink">
   <soap:Header>
      <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="SOAI_req_SOAI" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>bss</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">client</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
   	<ins:CreateRequest>
		<ins:RequestHeader>
			<ins:NeType>BST_COMMON</ins:NeType>
			<ins:OrderNo>$trace_id</ins:OrderNo>
			<ins:Priority>3</ins:Priority>
			<ins:ReqUser>sps_test</ins:ReqUser>
		</ins:RequestHeader>
		<ins:RequestParameters>
			<ins:Parameter name="LL_PRODUCT_NAME" value="SPS_PRODUCT_HLR_SIM"/>
            <ins:Parameter name="ITEM_TYPE" value="Product"/>
            <ins:Parameter name="MSISDN1" value="$so_tb"/>
            <ins:Parameter name="IMSI1" value="$imsi_old"/>
            <ins:Parameter name="IMSI2" value="$imsi"/>
            <ins:Parameter name="SIM_TYPE" value="$sim_type"/>
            <ins:Parameter name="NOTE" value="HPG API"/>
            <ins:Parameter name="PROVINE" value="$ma_tinh"/> 
		</ins:RequestParameters>
	</ins:CreateRequest>
   </soap:Body>
</soap:Envelope>