target/conf/req/dong_mo_dich_vu.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ins="http://soa.comptel.com/2011/02/instantlink">
   <soap:Header>
      <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="SOAI_req_SOAI" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>bss</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">client</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <ins:CreateRequest>
         <ins:RequestHeader>
            <ins:NeType>BST_COMMON</ins:NeType>
            <ins:OrderNo>$trace_id</ins:OrderNo>
            <ins:Priority>3</ins:Priority>
         </ins:RequestHeader>
         <ins:RequestParameters>
            <ins:Parameter name="LL_PRODUCT_NAME" value="$product"/>
            <ins:Parameter name="ITEM_TYPE" value="Product"/>
            <ins:Parameter name="MSISDN1" value="$so_tb"/>
            <ins:Parameter name="SPR_USER" value="ws_hpg"/>
            <ins:Parameter name="NOTE" value="Khoa mo dich tu API HPG"/>
            <ins:Parameter name="SPR_IP" value="10.156.3.211"/>
         </ins:RequestParameters>
      </ins:CreateRequest>
   </soap:Body>
</soap:Envelope>